In [56]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [57]:
from src.data_loader import DataLoader
from src.preprocess import cambio_escala

In [58]:
datos_personales = DataLoader().load_datos_personales()
print(datos_personales.shape[0])
datos_personales.head()

59

   user         name  age sex  occupation  children  y_c_age  o_c_age
0   123  Usuario_123   37   F           3         1        3        8
1   124  Usuario_124   42   M           8         1        3        8
2   125  Usuario_125   35   F          10         0        0        0
3   126  Usuario_126   50   M           4         0        0        0
4   127  Usuario_127   66   F          11         1       35       44

In [59]:
puntuaciones_usuarios = DataLoader().load_puntuaciones()
puntuaciones_usuarios = cambio_escala(puntuaciones_usuarios)
puntuaciones_usuarios.head(10)

   user  place  score
0   123  17376   8.33
1   123  17377   8.33
2   123  17380   8.33
3   123  17392   3.33
4   123  17395   5.00
5   123  17405   3.33
6   123  17411   0.00
7   123  17421   1.67
8   123  17425   8.33
9   123  17426   8.33

In [60]:
puntuaciones_usuarios_test = DataLoader().load_puntuaciones_test()
puntuaciones_usuarios_test = cambio_escala(puntuaciones_usuarios_test)
puntuaciones_usuarios_test.head(10)

   user  place  score
0   123  17365   8.33
1   123  17366   3.33
2   123  17367   3.33
3   123  17369   8.33
4   123  17371   8.33
5   123  17372   8.33
6   123  17374  10.00
7   123  17375   8.33
8   123  17378   0.00
9   123  17379   6.67

In [61]:
clasificaciones_items = DataLoader().load_clasificacion_items()
clasificaciones_items.sort_values("score")

      item  preference  score
366  18001          17     10
4    17367          26     20
202  17490          71     20
229  17501          27     20
215  17495          18     22
..     ...         ...    ...
354  17556          14    100
353  17556          38    100
99   17409          20    100
100  17409          91    100
104  17411          24    100

[383 rows x 3 columns]

In [62]:
items = DataLoader().load_items()
items.sort_values("views")

      item                                               name  views
36   17409                              Palacio del Almirante      0
145  18002                                   Barrio de Ruzafa      0
146  18003                                        La Albufera      0
147  18004                                 Barrio del Cabañal      0
143  18000  Centro de Arte Hortensia Herrero (CAHH) - Pala...      0
..     ...                                                ...    ...
66   17444                                Jardines de Viveros     37
61   17438                                Playa de las Arenas     37
91   17502              Fuente del Turia (Plaza de la Virgen)     37
23   17393                             Ciudad de las Ciencias     37
60   17437                             Playa de la Malvarrosa     38

[150 rows x 3 columns]

In [63]:
preferencias = DataLoader().load_preferencias()
preferencias.head(20)

    preference                        name  father
0            1          Estilos y periodos       0
1            2                     Compras       0
2            3                      Museos       0
3            4           Espacios Abiertos       0
4            5      Arquitectura religiosa       0
5            6      Arquitectura defensiva       0
6            7          Arquitectura civil       0
7            8                 Gastronomia       0
8            9                    Deportes       0
9           10                  Monumentos       0
10          11                        Ocio       0
11          12                 Salud y SPA       0
12          13                     Eventos       0
13          14                       Niños       0
14          15  Patrimonio de la Humanidad       0
15          16                Prehistórico       1
16          17                       Árabe       1
17          18                      Romano       1
18          19                    Medieval       1
19          20                      Gótico       1

In [64]:
usuarios_preferencias = DataLoader().load_usuarios_preferencias()
usuarios_preferencias.sort_values("score")

In [65]:
ocupaciones = DataLoader().load_ocupaciones()
ocupaciones.head(20)

    occupation                                               name
0            1                                    Fuerzas armadas
1            2  Dirección de las empresas y de las administrac...
2            3  Técnicos y profesionales científicos e intelec...
3            4                  Técnicos y profesionales de apoyo
4            5                   Empleados de tipo administrativo
5            6  Trabajadores de los servicios de restauración,...
6            7  Trabajadores cualificados en la agricultura y ...
7            8  Artesanos y trabajadores cualificados de indus...
8            9  Operadores de instalaciones y maquinaria, y mo...
9           10                       Trabajadores no cualificados
10          11                              Inactivo o desocupado

In [66]:
df_merged = datos_personales.merge(ocupaciones, on='occupation', how='left', suffixes=('', '_ocuppation'))
df_merged.rename(columns={'user': 'user_id','name_ocuppation': 'occupation', 'occupation': 'id_occupation', 'y_c_age': 'young_children_age', 'o_c_age': 'older_children_age'}, inplace=True)
df_merged.head()

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
0,123,Usuario_123,37,F,3,1,3,8,Técnicos y profesionales científicos e intelec...
1,124,Usuario_124,42,M,8,1,3,8,Artesanos y trabajadores cualificados de indus...
2,125,Usuario_125,35,F,10,0,0,0,Trabajadores no cualificados
3,126,Usuario_126,50,M,4,0,0,0,Técnicos y profesionales de apoyo
4,127,Usuario_127,66,F,11,1,35,44,Inactivo o desocupado

In [67]:
fuerzas_armadas_no_hijos_jovenes = df_merged[(df_merged['id_occupation'] == 1) &
                                       (df_merged['children'] == 0) &
                                         (df_merged['young_children_age'] == 0)
                                         ]

print(fuerzas_armadas_no_hijos_jovenes.shape[0])
fuerzas_armadas_no_hijos_jovenes

9

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
18,141,Usuario_141,42,M,1,0,0,0,Fuerzas armadas
26,149,Usuario_149,32,F,1,0,0,0,Fuerzas armadas
27,150,Usuario_150,43,F,1,0,0,0,Fuerzas armadas
38,161,Usuario_161,25,F,1,0,0,0,Fuerzas armadas
43,166,Usuario_166,24,F,1,0,0,0,Fuerzas armadas
44,167,Usuario_167,32,F,1,0,0,0,Fuerzas armadas
47,170,Usuario_170,55,M,1,0,0,0,Fuerzas armadas
54,177,Usuario_177,23,F,1,0,0,0,Fuerzas armadas
55,178,Usuario_178,36,F,1,0,0,0,Fuerzas armadas

In [68]:
hombres_sin_hijos_jovenes = df_merged[ (df_merged['sex'] == 'M') &
                                (df_merged['age'] < 40) &
                                (df_merged['children'] == 0) ]

print(hombres_sin_hijos_jovenes.shape[0])
hombres_sin_hijos_jovenes.head()

7

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
10,133,Usuario_133,24,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
15,138,Usuario_138,33,M,8,0,0,0,Artesanos y trabajadores cualificados de indus...
21,144,Usuario_144,28,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
48,171,Usuario_171,29,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
49,172,Usuario_172,37,M,3,0,0,0,Técnicos y profesionales científicos e intelec...

In [69]:
mujeres_sin_hijos_jovenes = df_merged[ (df_merged['sex'] == 'F') &
                                (df_merged['age'] < 30) &
                                (df_merged['children'] == 0) ]

print(mujeres_sin_hijos_jovenes.shape[0])
mujeres_sin_hijos_jovenes.head()

8

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
8,131,Usuario_131,25,F,2,0,0,0,Dirección de las empresas y de las administrac...
14,137,Usuario_137,26,F,5,0,0,0,Empleados de tipo administrativo
22,145,Usuario_145,27,F,6,0,0,0,"Trabajadores de los servicios de restauración,..."
25,148,Usuario_148,26,F,10,0,0,0,Trabajadores no cualificados
38,161,Usuario_161,25,F,1,0,0,0,Fuerzas armadas

In [70]:
hijos_chicos = df_merged[ ((df_merged['children'] == 1) & (((df_merged['young_children_age']<5) & (df_merged['young_children_age']>0)) | 
                                                           ((df_merged['older_children_age']<5)) & (df_merged['young_children_age']==0))) ]

print('filas', hijos_chicos.shape[0])
hijos_chicos

filas 11

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
0,123,Usuario_123,37,F,3,1,3,8,Técnicos y profesionales científicos e intelec...
1,124,Usuario_124,42,M,8,1,3,8,Artesanos y trabajadores cualificados de indus...
7,130,Usuario_130,37,F,3,1,1,6,Técnicos y profesionales científicos e intelec...
11,134,Usuario_134,41,F,5,1,4,7,Empleados de tipo administrativo
12,135,Usuario_135,40,M,1,1,4,6,Fuerzas armadas
13,136,Usuario_136,40,F,5,1,0,0,Empleados de tipo administrativo
16,139,Usuario_139,35,M,4,1,0,2,Técnicos y profesionales de apoyo
17,140,Usuario_140,46,M,5,1,0,0,Empleados de tipo administrativo
20,143,Usuario_143,33,M,2,1,0,3,Dirección de las empresas y de las administrac...
40,163,Usuario_163,43,M,3,1,0,2,Técnicos y profesionales científicos e intelec...
56,179,Usuario_179,40,F,3,1,3,5,Técnicos y profesionales científicos e intelec...

In [71]:
mededad_hijos = df_merged[(df_merged['children'] == 1 )&
                          (df_merged['age'] < 55) &
                          (df_merged['age'] > 30)]

print('filas', mededad_hijos.shape[0])
mededad_hijos

filas 18

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
0,123,Usuario_123,37,F,3,1,3,8,Técnicos y profesionales científicos e intelec...
1,124,Usuario_124,42,M,8,1,3,8,Artesanos y trabajadores cualificados de indus...
6,129,Usuario_129,42,F,5,1,5,11,Empleados de tipo administrativo
7,130,Usuario_130,37,F,3,1,1,6,Técnicos y profesionales científicos e intelec...
9,132,Usuario_132,52,M,2,1,20,32,Dirección de las empresas y de las administrac...
11,134,Usuario_134,41,F,5,1,4,7,Empleados de tipo administrativo
12,135,Usuario_135,40,M,1,1,4,6,Fuerzas armadas
13,136,Usuario_136,40,F,5,1,0,0,Empleados de tipo administrativo
16,139,Usuario_139,35,M,4,1,0,2,Técnicos y profesionales de apoyo
17,140,Usuario_140,46,M,5,1,0,0,Empleados de tipo administrativo
20,143,Usuario_143,33,M,2,1,0,3,Dirección de las empresas y de las administrac...
29,152,Usuario_152,49,F,3,1,0,19,Técnicos y profesionales científicos e intelec...
30,153,Usuario_153,42,F,5,1,5,7,Empleados de tipo administrativo
32,155,Usuario_155,34,F,5,1,0,10,Empleados de tipo administrativo
40,163,Usuario_163,43,M,3,1,0,2,Técnicos y profesionales científicos e intelec...
41,164,Usuario_164,52,M,3,1,0,13,Técnicos y profesionales científicos e intelec...
42,165,Usuario_165,48,F,3,1,0,23,Técnicos y profesionales científicos e intelec...
56,179,Usuario_179,40,F,3,1,3,5,Técnicos y profesionales científicos e intelec...

In [72]:
personas_libres = df_merged[(df_merged['id_occupation'] == 11) |
                             (df_merged['age'] >= 60) &
                               ((df_merged['young_children_age'] > 25) | (df_merged['children'] == 0))]

print('filas', personas_libres.shape[0])
personas_libres

filas 7

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
4,127,Usuario_127,66,F,11,1,35,44,Inactivo o desocupado
5,128,Usuario_128,79,F,11,1,50,56,Inactivo o desocupado
19,142,Usuario_142,60,F,1,1,36,40,Fuerzas armadas
23,146,Usuario_146,63,M,2,0,0,0,Dirección de las empresas y de las administrac...
31,154,Usuario_154,63,F,3,1,29,39,Técnicos y profesionales científicos e intelec...
33,156,Usuario_156,77,F,11,1,46,55,Inactivo o desocupado
34,157,Usuario_157,63,F,3,0,0,0,Técnicos y profesionales científicos e intelec...

In [73]:
tecnicos_profesionales_hijos = df_merged[((df_merged['id_occupation'] == 3) | (df_merged['id_occupation'] == 4)) &
                                         (df_merged['children'] > 0)]
print(tecnicos_profesionales_hijos.shape[0])
tecnicos_profesionales_hijos

12

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
0,123,Usuario_123,37,F,3,1,3,8,Técnicos y profesionales científicos e intelec...
7,130,Usuario_130,37,F,3,1,1,6,Técnicos y profesionales científicos e intelec...
16,139,Usuario_139,35,M,4,1,0,2,Técnicos y profesionales de apoyo
24,147,Usuario_147,56,M,3,1,30,33,Técnicos y profesionales científicos e intelec...
29,152,Usuario_152,49,F,3,1,0,19,Técnicos y profesionales científicos e intelec...
31,154,Usuario_154,63,F,3,1,29,39,Técnicos y profesionales científicos e intelec...
37,160,Usuario_160,55,F,3,1,30,33,Técnicos y profesionales científicos e intelec...
39,162,Usuario_162,59,M,4,1,27,28,Técnicos y profesionales de apoyo
40,163,Usuario_163,43,M,3,1,0,2,Técnicos y profesionales científicos e intelec...
41,164,Usuario_164,52,M,3,1,0,13,Técnicos y profesionales científicos e intelec...
42,165,Usuario_165,48,F,3,1,0,23,Técnicos y profesionales científicos e intelec...
56,179,Usuario_179,40,F,3,1,3,5,Técnicos y profesionales científicos e intelec...

In [74]:
tecnicos_profesionales_sin_hijos = df_merged[((df_merged['id_occupation'] == 3) | (df_merged['id_occupation'] == 4)) &
                                         (df_merged['children'] == 0)]
print(tecnicos_profesionales_sin_hijos.shape[0])
tecnicos_profesionales_sin_hijos

12

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
3,126,Usuario_126,50,M,4,0,0,0,Técnicos y profesionales de apoyo
10,133,Usuario_133,24,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
21,144,Usuario_144,28,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
34,157,Usuario_157,63,F,3,0,0,0,Técnicos y profesionales científicos e intelec...
45,168,Usuario_168,36,F,4,0,0,0,Técnicos y profesionales de apoyo
46,169,Usuario_169,29,F,3,0,0,0,Técnicos y profesionales científicos e intelec...
48,171,Usuario_171,29,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
49,172,Usuario_172,37,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
50,173,Usuario_173,37,F,3,0,0,0,Técnicos y profesionales científicos e intelec...
51,174,Usuario_174,41,F,3,0,0,0,Técnicos y profesionales científicos e intelec...
52,175,Usuario_175,37,F,3,0,0,0,Técnicos y profesionales científicos e intelec...
57,180,Usuario_180,34,M,3,0,0,0,Técnicos y profesionales científicos e intelec...

In [75]:
trinta_cuarenta_sinhijos = df_merged[(df_merged['age'] >= 30) & (df_merged['age'] <= 40) & (df_merged['children'] == 0)]
print(trinta_cuarenta_sinhijos.shape[0])
trinta_cuarenta_sinhijos

14

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
2,125,Usuario_125,35,F,10,0,0,0,Trabajadores no cualificados
15,138,Usuario_138,33,M,8,0,0,0,Artesanos y trabajadores cualificados de indus...
26,149,Usuario_149,32,F,1,0,0,0,Fuerzas armadas
28,151,Usuario_151,31,F,2,0,0,0,Dirección de las empresas y de las administrac...
36,159,Usuario_159,34,F,2,0,0,0,Dirección de las empresas y de las administrac...
44,167,Usuario_167,32,F,1,0,0,0,Fuerzas armadas
45,168,Usuario_168,36,F,4,0,0,0,Técnicos y profesionales de apoyo
49,172,Usuario_172,37,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
50,173,Usuario_173,37,F,3,0,0,0,Técnicos y profesionales científicos e intelec...
52,175,Usuario_175,37,F,3,0,0,0,Técnicos y profesionales científicos e intelec...
53,176,Usuario_176,34,F,6,0,0,0,"Trabajadores de los servicios de restauración,..."
55,178,Usuario_178,36,F,1,0,0,0,Fuerzas armadas
57,180,Usuario_180,34,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
58,181,Usuario_181,36,M,0,0,0,0,NaN

In [76]:
from src.assing_group import asignar_grupos

asignar_grupos(df_merged.iloc[10])

['hombre joven sin hijos', 'tecnicos_profesionales sin hijos']

In [77]:
from src.assing_group import asignar_grupos


df_merged['grupo'] = df_merged.apply(asignar_grupos, axis=1)
df_merged[['name', 'grupo']].head(10)

          name                                              grupo
0  Usuario_123  [con hijos pequenos, media edad con hijos, tec...
1  Usuario_124         [con hijos pequenos, media edad con hijos]
2  Usuario_125               [entre treinta y cuarenta sin hijos]
3  Usuario_126                 [tecnicos_profesionales sin hijos]
4  Usuario_127                             [personas desocupadas]
5  Usuario_128                             [personas desocupadas]
6  Usuario_129                             [media edad con hijos]
7  Usuario_130  [con hijos pequenos, media edad con hijos, tec...
8  Usuario_131                        [mujeres jovenes sin hijos]
9  Usuario_132                             [media edad con hijos]

In [78]:
from src.preprocess import get_all_preferences
from src.get_preference import get_group_preferences, recomendar_por_grupo

all_preferences, user_map = get_all_preferences(preferencias, usuarios_preferencias)
group_preferences = get_group_preferences(df_merged, all_preferences, user_map, asignar_grupos)

# ejemplo
nuevo_usuario = {'user_id': 1, 'name': 'Luis', 'age': 27, 'sex': 'M', 'id_occupation': 3, 'children': 0, 'young_children_age': 0, 'older_children_age': 0, 'occupation': 'Ingeniero'}

print("Usuario:", nuevo_usuario['name'], '\n')

# asigna grupo
grupo = asignar_grupos(nuevo_usuario)
print("Grupo del usuario:", grupo)

# vector de preferencias
recomendacion_vector = recomendar_por_grupo(nuevo_usuario, group_preferences, asignar_grupos)
recomendacion_vector

Usuario: Luis

Grupo del usuario: ['hombre joven sin hijos', 'tecnicos_profesionales sin hijos']

array([0.   , 0.   , 0.   , 0.   , 0.   , 0.   , 0.   , 0.   , 0.   ,
       0.   , 0.   , 0.   , 0.   , 0.   , 0.   , 0.   , 4.54 , 5.5  ,
       5.5  , 5.665, 6.375, 5.455, 5.335, 4.75 , 4.625, 5.5  , 6.46 ,
       5.96 , 7.33 , 7.375, 5.54 , 7.375, 7.915, 8.125, 7.83 , 6.125,
       6.375, 7.   , 6.17 , 7.04 , 5.54 , 6.08 , 0.   , 5.375, 5.335,
       6.585, 5.915, 4.   , 3.835, 3.5  , 6.54 , 5.83 , 5.915, 5.96 ,
       6.125, 5.835, 5.375, 5.25 , 0.   , 4.545, 4.04 , 5.125, 7.21 ,
       6.875, 6.46 , 5.125, 6.375, 5.92 , 6.335, 6.085, 4.875, 6.415,
       7.42 , 7.04 , 6.75 , 7.29 , 7.21 , 7.04 , 7.25 , 7.125, 5.915,
       6.04 , 6.335, 7.625, 7.125, 7.33 , 6.46 , 6.915, 7.835, 7.205,
       7.71 , 7.   , 8.165, 7.585, 6.79 , 7.67 , 8.21 , 7.92 , 6.625,
       7.085, 7.21 , 7.795, 6.96 , 6.67 , 7.21 , 6.54 , 6.5  , 7.045,
       4.915, 4.915, 6.455, 6.205, 5.795, 5.705, 5.665, 4.335])

por vecinos

In [ ]:
from src.preprocess import get_neighbours

get_neighbours(preferencias, usuarios_preferencias, 10).head(10)

,user_id,vecinos,pearson
0,123,"[124, 179, 150, 172, 165, 127, 129, 177, 166, ...","[0.81, 0.55, 0.54, 0.47, 0.41, 0.4, 0.4, 0.39,..."
1,124,"[123, 150, 179, 129, 166, 172, 178, 149, 173, ...","[0.81, 0.6, 0.54, 0.51, 0.47, 0.47, 0.46, 0.45..."
2,125,"[167, 134, 135, 176, 130, 123, 129, 148, 138, ...","[0.62, 0.54, 0.44, 0.41, 0.38, 0.37, 0.37, 0.3..."
3,126,"[179, 167, 142, 149, 175, 164, 135, 162, 140, ...","[0.9, 0.53, 0.52, 0.51, 0.48, 0.48, 0.43, 0.41..."
4,127,"[150, 160, 156, 165, 128, 153, 172, 124, 177, ...","[0.64, 0.64, 0.59, 0.58, 0.56, 0.5, 0.45, 0.44..."
5,128,"[156, 150, 165, 172, 127, 175, 160, 177, 144, ...","[0.71, 0.68, 0.62, 0.57, 0.56, 0.53, 0.52, 0.4..."
6,129,"[176, 124, 164, 134, 142, 169, 168, 161, 135, ...","[0.61, 0.51, 0.5, 0.5, 0.45, 0.44, 0.43, 0.43,..."
7,130,"[147, 125, 167, 176, 152, 168, 129, 143, 138, ...","[0.41, 0.38, 0.36, 0.34, 0.32, 0.32, 0.32, 0.3..."
8,131,"[154, 128, 156, 173, 157, 136, 169, 149, 145, ...","[0.31, 0.17, 0.16, 0.15, 0.14, 0.12, 0.12, 0.1..."
9,132,"[133, 139, 154, 146, 143, 142, 159, 155, 137, ...","[0.15, 0.14, 0.11, 0.11, 0.09, 0.08, 0.07, 0.0..."